[{"name":"Mister Oso","cost":2,"address":"\n3163 Larimer St\nDenver, CO 80205\n(720) 677-6454\n","cuisine":"Latin","review":"Mister Oso’s squat green bungalow and vine-covered patio make it the closest thing you’ll find to an oasis in RiNo. It also doesn’t hurt that the food - tacos, cebiche, coconut rice, and varied salads - also has a habit of transporting us to a vacation mindset. The dishes recall memories of island taco stands, while plates arrive stacked high with buttermilk fried chicken, pastor with roasted cauliflower, and pork belly with tomato escabeche and poblano sweet and sour. The daily roster of frozen drinks is equally fun and always full of rum, mezcal, fresh fruit, and the occasional splash of fernet, just as it should be."},{"name":"Misfit Snackbar","cost":2,"address":"\n3401 E Colfax Ave\nDenver, CO 80206\n201-679-​7079\n","cuisine":"Bar Food","review":"Served from a small window attached to a barely closet-sized kitchen in the corner of a City Park cocktail bar, Misfit Snackbar has quickly become an all-day hub for its almost psychedelic interpretations of dishes from across the globe. The menu is constantly changing, with plates like hamachi crudo being revamped with sweet pea and lemon curd, pickled fresnos, soy pickled ramps, and pistachio crumble. It only gets wilder from there - both in terms of titles and ingredients - with items like the ham wallet, lollipopped chicken, and the My F*cking Burger all displaying the same kind of subtle trippiness (and deliciousness)."},{"name":"Forget Me Not","cost":2,"address":"\n227 Clayton St.\nDenver, CO 80206\n+17202595369\n","cuisine":"Bar","review":"The front patio of Forget Me Not can often be found lined with massive crystal vats of large-format cocktails, glasses of organic wine, the occasional plate of caviar, and plenty of people looking very content with their current reality. Rumors of a lobster crunch wrap that occasionally joins the menu add to the allure here, with each day seeing slight adjustments to a menu that favors cheese and salumi boards, Spanish razor clams, and a colorful crudite laid out on ice-filled oyster platters. Despite being a little chic (did we mention the caviar?), this place never feels exclusive and is one of our favorites for spending a long night out in Denver."},{"name":"Brutø","cost":4,"address":"\n1801 Blake St\nDenver, CO 80202\n720.325.2195\n","cuisine":"Fusion","review":"After spending the better part of a year serving wood-fired pizzas and oysters, Bruto changed directions, opting to become a chef’s counter with two services per evening. The food itself also changed dramatically, as the chef transformed the place into a celebration of the food of Mexico, Texas, Colorado, Japan, and Korea. This is a special place built for special occasions, with dishes changing seasonally and really whenever else they feel like it. They also grow lots of things onsite, with hydroponic systems, pickling jars. and drying racks making great use of each piece of the carefully sourced ingredients. And the dishes do a great job of highlighting all of those details with things like rotating augachiles, hearth bread with mole blanco and miso butter, and wagyu with wild mushroom and mole negro."},{"name":"Blackbelly","cost":3,"address":"\n1606 Conestoga St\nBoulder, CO 80301\n303-247-1000\n","cuisine":"American","review":"Whatever it is that’s caused you to take the 45-minute drive up to Boulder, be it the hiking trails or promises of a place where the kombucha flows like wine, no trip is complete without a stop at Blackbelly. If you go early, stop by the deli counter for one of their great breakfast burritos. But head over in the evening for an experience that highlights produce and prime cuts from local farms, most of which aren’t much further away from the restaurant than Denver. Crispy pig ears sit comfortably next to fresh-flown oysters and an endless array of never-to-be-repeated charcuterie items aged right next door. While your server may not always be able to go full Portlandia and tell you the name of the chicken you’re eating, there’s also a good chance that if you catch them on the right night, they may be able to dig it up from somewhere."},{"name":"Temaki Den","cost":4,"address":"\n3350 Brighton Blvd Unit #100\nDenver, CO 80216\n(720) 465-9263\n","cuisine":"Sushi","review":"Temaki Den is the new hand roll spot from the team behind one of Denver’s longest-held crown jewels, Sushi Den. Located in the center of The Source in RiNo - a food hall composed of several of the city’s other heavy hitters - this largely counter-service operation is slightly more casual than its predecessor. Sashimi, appetizers, a few rolls, and several sweets provide the bulk of the menu - with the beautifully arranged hand rolls being filled generously with ingredients like salmon skin, fatty tuna, wagyu, and daikon radish sprouts. This is a place where you can see and be seen, although most people will probably be too busy looking at their food to notice you."},{"name":"Yuan Wonton","cost":1,"address":"\n\n,  \n720-961-3406\n","cuisine":"Chinese","review":"Wherever and whenever Yuan Wonton pulls up, there is guaranteed to be a crowd. When the truck first opened, block-long lines would form as hungry dumpling-lovers waited patiently for the famous chili wontons and whatever else happened to be on the menu that day. Over the last year, the team moved its system to online, with website crashes and two to three minute sellouts likening the ordering process more to coveted shoe releases or acquiring impossible to get concert tickets. Recently, lines began forming again, a sure sign that nature is healing. The thumb-sized wontons, drenched in a particularly zesty house-made chili crisp, tend to disappear so quickly after they’re opened, it would come as no surprise to find a to-go box of them on StockX or any other website where rarities get scalped at a massive premium."},{"name":"El Taco De Mexico","cost":1,"address":"\n714 Santa Fe Drive\nDenver, CO 80204\n(303) 623-3926\n","cuisine":"Mexican","review":"El Taco de Mexico is an institution. You can tell by the cauldrons of green chili - so big that some of the ladies working the stoves have to use a step-ladder to stir it - that this is hallowed ground. This is the place to go for tacos stacked high with lengua, tripe, al pastor, and barbacoa. There are also tortas, tamales, soups, and hamburgers, and no matter what you order, the service is always super quick. The only real rule here is that everything should be paired with a massive glass of house-made horchata. Trust us."},{"name":"Onefold","cost":2,"address":"\n1429 E 18th Ave\nDenver, CO 80218\n303-954-0877\n","cuisine":"Brunch","review":"If your group tends to argue about the superior merits of breakfast burritos vs. scrambles, frittatas, or croissant sandwiches, Onefold in Uptown is a place to find all the best bits of a morning meal all on one table. You can opt for a congee - with chicken and duck broth, duck confit, poached eggs, scallions, and salted ginger - or grab a breakfast quesadilla or chilaquiles. Of course, there are mimosas, but for anyone who wants to veer away from the pre-noon classic, there’s bourbon-laced Vietnamese coffee, a Bloody Maria, and a selection of Dry Dock hard seltzers. And in what may be Denver’s most decadent treat, no visit here is complete without an order of the bacon fried rice, with plenty of chili oil and duck fat fried eggs."},{"name":"Twansburger","cost":1,"address":"\n\n,  \n","cuisine":"Burgers","review":"In the spring of 2021, Twansburger began showing up in various lots around town, generally as part of some established pop-up featuring a selection of other up-and-comers. And even from the get-go, this place has attracted a loyal following while opting to keep things super simple. Here you have two options: a single or a double. It’s best to go double, especially if you were lured from blocks away by the smell of perfectly-spiced patties wafting indiscriminately in all directions. Outside of that, your options are limited - burgers come with homemade pickles, diced white onion, shredded lettuce, American cheese, and house sauce. But that’s part of what makes the place so comforting, second only to all the smiling faces of those who surely finished their burger just a few steps from the register."},{"name":"Seoul Korean BBQ And Hot Pot","cost":3,"address":"\n2080 S. Havana St.\nAurora, CO 80014\n303-632-7576\n","cuisine":"Korean","review":"While Aurora has its fair share of bustling Korean barbecue restaurants, none of them are quite as festive as Seoul Korean BBQ and Hot Pot. The plates here always seem to be just a little fuller than what we’re used to and each one always arrives just a little faster than anywhere else on the block. The servers seem to anticipate your desires a good five minutes before you yourself have thought of them, with an endless array of banchan always being swapped out before anyone at the table has taken the last bite. A little excess is expected here - especially in the form of endless stacks of thick-cut pork belly, jowl, and collar - but it’s also encouraged, and it’s only as you find yourself waddling to the car that you realize how full and happy you’ve become."},{"name":"Super Mega Bien","cost":3,"address":"\n1260 25th St\nDenver, CO 80205\n7202694695\n","cuisine":"Latin","review":"When a dim sum cart rolls by the tables of Super Mega Bien, you can expect small plates of lamb barbacoa, Brazilian shrimp sopa, fried plantains, and steamed buns with sweetened condensed milk to hit the table just as quickly as you can order them. Here you can eat spring rolls with sun-dried tomatoes and cheese between sips from a tall glass of cachaca, or opt for ceviche and Spanish croquettes alongside a hop-infused gin and tonic. There are also family-style dishes, like full racks of ribs coated in green chili, and steaming lamb barbacoa that comes wrapped in banana leaf. Just make sure you order enough to share (or not)."},{"name":"Pho 95","cost":1,"address":"\n1401 S Federal Blvd\nDenver, CO 80219\n(303) 936-3322\n","cuisine":"Vietnamese","review":"Pho 95 is the kind of place that always seems to have a small wait, be it the depths of winter or a scorching mid-August day. And even though there are easily 15 other pho restaurants within jogging distance, this is the place to go in Little Saigon. The pho, especially the bowls overflowing with the spot’s real claim to fame - a fried-garlic heavy veggie broth - always arrive with heaping plates of basil, dandelion, limes, and beansprouts. Though for anyone not quite so soup-inclined, the menu also has beef short rib plates, noodle bowls, and crispy noodle options."},{"name":"Open","cost":2,"address":"\n2706 Larimer St\nDenver, CO 80205\n","cuisine":"Sandwiches","review":"Googling “Open Sandwich Denver” will inevitably take you to a list of every available sandwich place that is not currently closed. And even offline, Open can also be hard to find in real life. It serves its sandwiches from the back of American Bonded, a dimly-lit cocktail bar known for its great and affordable drinks. The only real indication that Open is there is a small podium bearing its name. But find it you should, as the spot came up with the rather novel concept of reaching out to some of the city’s best chefs and having each one contribute a different sandwich to the menu. Everything is good, but The Lee - a Sichuan French Dip with a ruby-red, tongue-numbing dipping sauce from Hop Alley’s own Tommy Lee - is the one you should make a priority."},{"name":"Restaurant Olivia","cost":3,"address":"\n260 Downing\nDenver, CO 80209\n303-999-0395\n","cuisine":"Pasta","review":"If you’ve been planning on finally confessing some deep feelings to someone and need a white tablecloth to do it over, Restaurant Olivia is probably a good room for it. Especially if that certain someone likes quiet, candle-lit dining rooms complete with the kind of service that is usually reserved for visiting dignitaries. You can expect the homemade pasta to feature ingredients like black truffle, bay scallops, and Maine lobster. But even if you’re someone who enjoys eating their body weight in noodles alone, no visit here is complete without a plate of seared foie gras, which comes spread atop some pillowy banana bread and is served with a bacon and Madeira jus, and a legitimately transformative foie gras gelato. And as with everything else, the cocktails here (and even non-alcoholic drinks) are approachable, despite being made with teas, house infusions, and even foraged ingredients. There’s a Nutella Boulevardier and a Carrot Negroni,  each of which works even better than it looks on paper."},{"name":"Finn’s Manor","cost":2,"address":"\n2927 Larimer St\nDenver, CO 80205\n","cuisine":"Five Points","review":"If you have a large group, round them up at Finn’s. It’s basically one big covered patio filled with food trucks (you’ll find BBQ, Filipino, Jamaican, steamed buns, and ice cream). And just off the main patio, there’s a cajun-themed cocktail bar where the group can kill time playing card games with a ridiculous amount of whiskey."},{"name":"Ale House at Amato’s","cost":2,"address":"\n2501 16th St\nDenver, CO 80211\n(303) 433-9734\n","cuisine":"Bar Food","review":"The Ale House has been the unofficial drinking hub in LoHi for quite some time, and for good reason.The patio up top also provides a nice view of the Denver cityscape, while the patio downstairs provides nice people watching. There’s also a full menu of typical but solid bar food that we endorse."},{"name":"Historians Ale House","cost":2,"address":"\n24 Broadway\nDenver, CO 80203\n(720) 479-8505\n","cuisine":"Bar Food","review":"According to the website, Historians is all about giving you “a unique Colorado experience,” which apparently means they have a ton of locally-brewed beers and a menu with a lot of locally-sourced ingredients. The patio up top has great mountain views and big tables for larger groups, and the happy hour includes half-off bottles of wine on Wednesdays. If you can’t make it after work, late-night drinks or big group brunches are also a good move here."},{"name":"Highland Tap and Burger","cost":2,"address":"\n2219 W 32nd Ave\nDenver, CO 80211\n(720) 287-4493\n","cuisine":"Bar Food","review":"Highland Tap is one of the best spots in town no matter the time of day (or night) for drinks and some food. The burger is great, the waits are never too long, and the front patio makes for great people watching. Get a side of the kids mac and cheese (trust us when we tell you it’s way better than the regular version), and watch the K-State folks in the bar area get rowdy when the Wildcats play."},{"name":"Highland Tavern","cost":1,"address":"\n3400 Navajo St\nDenver, CO 80211\n(303) 433-1990\n","cuisine":"Bar Food","review":"The Tavern has a weird 80’s hair band nostalgia-meets-Vegas sports bar vibe, and it turns out that Poison and baseball blend together really well. It also doesn’t hurt that the Tavern has some of the best bar food in town. Get some tater tots, head to the large covered patio upstairs, and plan to stay a while. If you can’t be at Coors Field for a Rockies game, watching it here is your next best option."},{"name":"Whiskey Tango Foxtrot","cost":2,"address":"\n2907 Huron St #106\nDenver, CO 80202\n(303) 226-1540\n","cuisine":"American","review":"WTF is the perfect example of why you shouldn’t judge a book by its cover. It’s true that it’s mainly a spot for the bottomless brunch crowd, but the Southern food is worth putting up with having to hear about how the people around you “crushed it last night, bro.” Also, the best time to be here isn’t on the weekends - it’s after work on a weekday. The covered rooftop patio also has a good amount of space, and a great view of the downtown skyline."},{"name":"Local 46","cost":2,"address":"\n4586 Tennyson St\nDenver, CO 80212\n(720) 524-3792\n","cuisine":"Bar Food","review":"Local 46 is a few minutes from the more popular part of Tennyson St., but it’s worth the trip, and a great way to avoid the crowds in that area. It’s a laid-back beer drinking type of place, so bring your low-key friends for a big group hang. The wide-open patio out back has a ton of seating, ping pong, and an outdoor food hut that occasionally serves burgers and excellent sausage plates (usually weekends and evenings). And if you’re here in the summer, there’s a good chance you’ll see some live music."},{"name":"Avanti","cost":2,"address":"\n3200 Pecos St\nDenver, CO 80211\n(720) 269-4778\n","cuisine":"LoHi","review":"This market-style food court sits just west of the city in the Lower Highlands, and it’s best utilized as the rendezvous point for your crew in the afternoon or early evening, before heading out on the town for a big night. While the food is simply decent (the arepas are your best bet) and a bit overpriced, the rooftop bar is huge and has some of the best views in town, and the multiple bar areas mean you’ll never have to wait too long for a drink."},{"name":"Postino","cost":2,"address":"\n2715 17th St\nDenver, CO 80211\n(303) 433-6363\n","cuisine":"Wine Bar","review":"Postino is a nice (but not stuffy) wine bar with a ton of affordable options (the daily happy hour is $5 glasses). The patio out back has a good amount of space, and as far as food goes, we like the bruschetta to snack on (and even out your wine consumption). This is a good spot for girls’ night out."},{"name":"Briar Commons Brewery","cost":2,"address":"\n2298 N Clay St\nDenver, CO 80211\n","cuisine":"Bar Food","review":"Briar Commons is a brewery\/restaurant type of place, and it’s a great spot for a guys night or day drinking outing. The food is decent, but you’re really here for the brewed-on-site beer. And the roof deck that looks over Jefferson Park. If you do get hungry while taking in the views, go for the burger."},{"name":"El Five","cost":3,"address":"\n 2930 Umatilla, Fifth Floor\nDenver, CO 80218\n303.524.9193\n","cuisine":"Spanish","review":"Five floors up in the Lower Highlands, El Five’s patio has a beautiful panorama view of the downtown skyline and a tapas and cocktail menu that’s just as good as the sights. The Mediterranean food is a bit pricey, but it’s definitely worth the splurge for a nice night out. Make sure to get the shawarma spiced lamb ribs, and if the patio tables are full, a seat at the bar has the same views and faster drinks service."},{"name":"The Monkey Barrel","cost":1,"address":"\n4401 Tejon St\nDenver, Colorado 80211\n720-638-3655\n","cuisine":"Sandwiches","review":"One of Denver’s favorite Italian delis is back and running the shop out of the Monkey Barrel bar in Sunnyside. The old school bodega vibe has been switched out for old school band posters, but the menu is the same. We like it best for lunch, but it’s open until 2am to satisfy your late night needs too. The meatball and the italian sausage subs are our favorites, and you can play mario kart in the back booths while you wait for them to come out."},{"name":"Brider","cost":1,"address":"\n1644 Platte St\nDenver, CO 80202\n","cuisine":"American","review":"Brider is our favorite upscale fast-casual spot for lunch in the city- fast-casual because you order at the counter, upscale because the food is restaurant-quality. There’s a fresh rotisserie chicken right behind the checkout counter, sweet potato and avocado salads, porchetta and kimchi sandwiches, rotating pizza options daily, and freshly baked pastries to finish off the meal. If you want to stay awhile, there’s also a full bar with a good happy hour deal. The only downside is that the parking situation isn’t great, so plan accordingly."},{"name":"Masterpiece Delicatessen","cost":1,"address":"\n1575 Central St\nDenver, CO 80211\n(303) 561-3354\n","cuisine":"Sandwiches","review":"Every city needs a go-to sandwich shop, and Masterpiece is Denver’s best. There are a few around town, but we usually find ourselves at the LoHi location. The menu doesn’t have a lot of items you haven’t seen before, but they do a good job of making the classics a little more interesting - the ham and cheese comes on a thyme baguette with some crunch to it. The veggie is also the best in town. Get it and head over the pedestrian bridge for a picnic in Confluence Park."},{"name":"Salt & Grinder","cost":1,"address":"\n3609 W 32nd Ave\nDenver, CO 80211\n","cuisine":"Sandwiches","review":"Salt & Grinder is our favorite sandwich shop to hit when you have some time to kill (because finishing an entire meal here will take some dedication). The menu has Italian classics like meatball and chicken parm, but also salads, soup, and breakfast options. Post up on the patio with The Frankie and a beer and do some people watching."},{"name":"Pizzeria Locale","cost":1,"address":"\n3484 W 32nd Ave\nDenver, CO 80211\n","cuisine":"Pizza","review":"This is a fast-casual pizzeria from the people at Frasca, which alone is enough to get people in the door. But the pizza here is what keeps everyone coming back. They’re Neapolitan style, and the fresh, chewy dough and excellent toppings make them a serious contender for best thin crust in town. They also come out in under 5 minutes, so they’re a great move for a quick lunch or dinner."},{"name":"Bones","cost":2,"address":"\n701 Grant St\nDenver, CO 80203\n(303) 860-2929\n","cuisine":"Japanese","review":"Bones has a small but reliable Asian fusion menu, with things like duck confit steamed buns and braised pork udon. The patio and the open kitchen make it a surprisingly great place for a date - if your date doesn’t mind watching you stuff your face with escargot pot stickers and bone marrow. (If your date does mind, you maybe should not be dating.) We also like it as a mid-week lunch spot if you work around Governors Park."},{"name":"Denver Central Market","cost":2,"address":"\n2669 Larimer St.\nDenver, Colorado 80205\n","cuisine":"River North","review":"This food hall sits right in the middle of the Rino neighborhood, and has a nice variety of stuff to choose from (pizza, sandwiches, seafood, sandwiches, and ice cream, to name a few), as well a full bar with plenty of seating. It’s a nice spot to grab a drink and snack and hang around for a bit during the day. The price points are a little higher than similar markets around town (Avanti, Stanley Market), but it’s a great option if you’re around the arts district."},{"name":"Royal Rooster","cost":2,"address":"\n3316 Tejon St\nDenver, CO 80211\n720.420.0622\n","cuisine":"Burgers","review":"Old Major is no secret, but we like it best on weekdays during lunch when the patio and bar areas transform into Royal Rooster. From 11am-3pm, Rooster sets up shop with a limited but excellent menu of sandwiches (seven options total). The semi-hidden Lower Highlands spot is one of Denver’s best under the radar options, and while the chicken sandwiches are excellent, the burger is our favorite in the city."},{"name":"Woodgrain Bagels","cost":1,"address":"\n2525 Arapahoe Avenue\nBoulder, Colorado 80302\n","cuisine":"Bagels","review":"If you don’t know about Montreal-style bagels (we didn’t either), let Woodgrain be your introduction. Compared to ones you’d find in New York, these are sweeter and more dense. We think it has something to do with being boiled and then wood-fired, but we’re more concerned with how excellent of a sandwich they make. Go for the breakfast bacon, egg, and cheese on a poppyseed or everything."},{"name":"The Pig & The Sprout","cost":2,"address":"\n1900 Chestnut Pl\nDenver, CO 80202\n(720) 535-9719\n","cuisine":"American","review":"A casual new spot near Coors Field downtown, The Pig & Sprout has a wide open bar space and solid American food. It’s mostly what you’d expect from an upscale sports bar, except there are some twists - namely, half the menu’s focus on vegetarian plates. We’ve been impressed with most things on the menu, but the pork tacos are our go-to."},{"name":"Sloan’s Lake Tap & Burger","cost":2,"address":"\n1565 Raleigh St\nDenver, CO 80204\n","cuisine":"Bar Food","review":"Sister to the popular Lower Highlands Tap & Burger, Sloan’s has a more refined vibe, but still serves the same pub-style menu you’ve come to love from the original. If the Tap & Burger locations were a mullet, this one would be the business in front - use it for lunch meetings and other situations requiring a little more polish. This is an excellent, kind of upscale brewpub that also serves as a great late-afternoon spot to catch a game on TV (after the business crowd has moved on)."},{"name":"The Post Chicken And Beer","cost":2,"address":"\n2200 S Broadway\nDenver, CO 80210\n","cuisine":"Southern","review":"The Post is everything Cracker Barrel wants to be - homey country feels, southern charm, and delicious, gravy-soaked comfort food. Only instead of a kitschy gift shop, golf tee triangle games, and terrible food, The Post is actually a place you want to hang out - especially because they also have a brewery on the premises. Best for large groups and lazy afternoons, and home of some of the best family-style fried chicken in Denver."},{"name":"Quality Italian","cost":4,"address":"\n241 Columbine St.\nDenver, CO 80206\n","cuisine":"Italian","review":"A recent transplant from NYC, this is Denver’s newest steakhouse and one of the more hyped special occasion restaurants in town. The upscale setup involves some gimmicks (black-tie-wearing staff, tableside steak preparation), and a high-priced menu. All of which might give you pause, but once the meats and pastas start to roll out, all concerns will fade away. Everything here is top notch, and very much worth your time and money. They serve lunch, but big group throw-down dinners are what you want to use this place for."},{"name":"Fish N Beer","cost":3,"address":"\n3510 Larimer St\nDenver, CO 80205\n303.248.3497\n","cuisine":"Seafood","review":"A newer RiNo spot serving a small but solid menu of fresh seafood and (you guessed it) beer. All the food here is worth your time - especially the grilled oyster plates and the blowfish basket. The main entree options are good but pricey, and make for a nice solo dinner or date night. However, we like this place best for the smaller plates and early afternoon happy hours. Especially on weekdays when tables are easy to come by without need for reservations."},{"name":"Saigon Bowl","cost":1,"address":"\n333 S Federal Blvd Unit 134\nDenver, CO 80219\n(303) 935-2427\n","cuisine":"Vietnamese","review":"Saigon has been a South Federal staple forever, and the food here never misses a beat. We especially like the vegetarian options when we’re looking to act a little healthier during the winter months. The vegetarian pho here is the best in Denver."},{"name":"Avelina","cost":3,"address":"\n1550 17th St\nDenver, CO 80202\n720.904.6711\n","cuisine":"American","review":"Conveniently located in one of the busier downtown areas, Avelina is a new fine dining dinner spot, but we like it best for classier work lunches, or post-work cocktails. Stick with the salad menu if you’re doing lunch (warm artichoke and baby kale are the best), and definitely look to grab seats at the bar."},{"name":"Dio Mio","cost":2,"address":"\n3264 Larimer St\nDenver, CO 80205\n(303) 562-1965\n","cuisine":"Italian","review":"Dio Mio is pairing a fast-casual atmosphere with fresh, homemade pastas. Seems like a fun idea, and we like the relaxed order-at-the-counter setup. But the food just isn’t quite up to par with other fresh pasta shops around town. We’re hoping that has more to do with the newness of this place, but as it is right now, Dio Mio is best for quick apps (especially the fried mozzarella) and a glass of wine after work - not the full dinner play."},{"name":"Rush Bowls","cost":2,"address":"\n1665 Central St.\nDenver, CO 80211\n(720) 287-2844\n","cuisine":"American","review":"A quick acai bowl to-go on your way to work in the morning is never a bad idea, and Rush Bowls is best place to grab said bowls in Denver. With a good mix of options, we’re guessing you won’t have a problem finding a few favorites."},{"name":"The Plimoth","cost":3,"address":"\n2335 E 28th Ave\nDenver, CO 80205\n(303) 297-1215\n","cuisine":"American","review":"We do our best to avoid superlatives when talking about restaurants. But in the case of The Plimoth, we're going to go ahead and throw caution to the wind - it's the absolute best date night spot in Denver. Hype around this place may have died down since opening a few years ago, but if you're in need of a special place to take someone special (even if that someone is you), set your course here. \nThe Plimoth is a quaint neighborhood spot with an intimate setting, both in actual size and vibes. The cracker jack box dining room keeps the tables close, enough so you might become friends with your neighbors, but you won't be bothered by it. Especially after the food and wine starts to roll out. \nThe menu leans toward the heavier side of things, so be ready to eat stuff like sweet potato pierogies, pork rillette, and cracklin' chicken - which might all sound simple, but the flavors are nuts. If at this point you're thinking that this kind of rich food isn't ideal for a first date, you're probably right. Which is why you should consider coming here with someone who's seen you take down a plate of food before. And still likes you.\nThere's an elegance to The Plimoth, but zero pretension. And regardless of the occasion, dinner here always feels special. Just remember that we're only responsible for making the perfect date night restaurant recommendation. The rest is on you."},{"name":"Spuntino","cost":3,"address":"\n2639 W 32nd Ave\nDenver, CO 80211\n(303) 433-0949\n","cuisine":"Italian","review":"The more things change, the more they stay the same. Never was a phrase more relevant to a restaurant as that one is to Spuntino. We've gotten very familiar with this place, and have come to rely on two things about it: we always know we're going to be surprised with something new, and not surprised when we love it. Does that mean Spuntino is predictable? Absolutely. But in the best way possible. The restaurant is so consistently good, we always walk in expecting great things. And so far, those expectations have been met every single time.\nTheir menu changes with the season, but it's generally full of handmade, simple noodle dishes - we've had meaty bolognese plates that fill us up after three bites, and we've also had light, broth-based specials that taste so good we order two. Add in their small but strong wine list, and Spuntino is the perfect choice for special occasions. Especially date night, or if you’re looking to celebrate something with a small group.\nThe corner space located in the Lower Highlands is exactly the kind of quaint spot everyone wants in their neighborhood. It's an especially great early-evening move, as after dinner you can head down the street a few blocks to the more happening section of LoHi to grab some drinks or just walk off all the carbs you just stuffed down your gullet.\nOne other unexpected thing we've come to expect: Spuntino is somehow usually pretty easy to get into. We're always baffled by this, as you'd assume a place this good would be consistently packed. But we're selfishly happy it's remained largely a secret. Here's hoping that's just one more part of Spuntino that stays the same."},{"name":"Coperta","cost":3,"address":"\nCoperta, 400 E 20th Ave.\nDenver, CO 80203\n3037368400\n","cuisine":"Italian","review":"Coperta is one of Denver’s best new pasta spots, with a menu full of plates designed to share. The setting is pretty lively, so we recommend going with a bigger group. Plus you’ll have a good reason to order a ton and try as much as possible. And if you can score spots at the Mozzarella bar, all the better."},{"name":"High Point Creamery","cost":2,"address":"\n2669 Larimer St.\nDenver, CO 80205\n","cuisine":"Dessert","review":"An artisanal ice cream shop with a nice mix of sweet, savory, and sometimes experimental flavors. They’ve got everything from Salted Caramel to Tin Cup Whiskey with Pistachio Brittle. Located in the new Central Marketplace, High Point is a people watching mecca. They also serve ice cream flights (as if you needed another excuse to go)."},{"name":"Buchi Cafe Cubano","cost":1,"address":"\n2651 W 38th Ave\nDenver, CO 80211\n(303) 458-1328\n","cuisine":"Sandwiches","review":"Buchi is a Cuban coffee and sandwich cafe perfect for spending a few hours either working or relaxing. We prefer the big patio out front during the warmer months, but the inside is spacious as well, and works great for offsite meetings. There’s also a full bar inside to celebrate any work you get done between the cortaditos and spicy aye conyos."},{"name":"Roo Bar","cost":1,"address":"\n3480 Park Ave W\nDenver, CO 80216\n(303) 455-8700\n","cuisine":"American","review":"Roo Bar is a divey sports bar that sits under an interstate off-ramp. It also has some of the best wings in the city. We aren’t sure what goes into their “crack sauce,” but we don’t really care because it’s delicious."},{"name":"The Crawling Crab","cost":2,"address":"\n763 S Federal Blvd\nDenver, CO 80219\n","cuisine":"Seafood","review":"Just because we live in the middle of the country doesn't mean we can't get good shellfish, and that's all The Crawling Crab wants to give you. This place looks gimmicky upon first glance, but once you start cracking shells and sucking crawfish heads, you'll be pleased. There's a nice mix of king, snow, dungeness, and blue crab, full-bodied shrimp, and when in season, crawfish. It's all dumped on your table Louisiana-style with sausage and potatoes to boot. Get ready to dive in."},{"name":"Axios","cost":2,"address":"\n3901 Tennyson St\nDenver, CO 80212\n(720) 328-2225\n","cuisine":"Greek","review":"We love Axios when we’re in the mood for a change of pace and a heavy dose of hospitality. The food is fresh, and the menu sticks to traditional Greek favorites. We’re big fans of the Gyros, Saganaki, Spanakopita, and especially the service. The waitstaff here is always happy to see you."},{"name":"Tokio","cost":2,"address":"\n2907 Huron St\nDenver, CO 80202\n(720) 639-2911\n","cuisine":"Japanese","review":"Offering hearty ramen bowls, sushi, and a wide variety of appetizers and Japanese BBQ items, Tokio is simultaneously perfect for solo meals and late night group meetups alike. As one of the only downtown area restaurants open late during the week (till 1am Monday-Thursday), Tokio is a lesser-known Infatuation favorite for Japanese. The sushi bar can almost always accommodate you if you’re dining solo, and the charcoal grilled small plates menu is sure to help ease the hangover you’ll have at work the next day."},{"name":"Lao Wang Noodle House","cost":1,"address":"\n945 S Federal Blvd\nDenver, CO 80219\n(303) 975-2497\n","cuisine":"Chinese","review":"This is one of the best hole in the walls, and arguably the best place for dumplings, in Denver. Service will be on the slower side, and your server will likely be a little grumpy, but it's all worth it for the great potstickers, bao buns, or any of the noodle bowls. The Beef Noodle Soup here is basically a nap in a bowl."},{"name":"Vital Root","cost":2,"address":"\n3915 Tennyson St\nDenver, CO 80212\n(303) 474-4131\n","cuisine":"Vegetarian","review":"Everyone has a vegan or vegetarian friend, and they deserve good food too, even if they do choose to deny it to themselves 90% of the time. Vital Root is currently holding court as the chief roughage shop in town, for meat-free people and meat lovers alike."},{"name":"Sushi Den","cost":4,"address":"\n1487 S Pearl St\nDenver, CO 80210\n(303) 777-0826\n","cuisine":"Japanese","review":"Sushi Den has the best raw fish in the city. As one of the very first sushi bars in the United States to buy directly from markets in Japan, you won’t find fresher fish, or a fresher atmosphere. A seat at the sushi bar overseeing the knife work and roll prep is as entertaining as it is delicious. And the omakase play here is a must-do at least once, especially if you live in Denver."},{"name":"Vert Kitchen","cost":2,"address":"\n704 S Pearl St\nDenver, CO 80209\n(303) 997-5941\n","cuisine":"American","review":"As one of Denver’s early farm-to-table spots, Vert has been able to not only survive, but thrive despite the massive influx of similar restaurants around town. The menu has fewer than ten items, but they’re all good. Great grab-and-go for lunch, and small group brunches here can’t be beat. Plus the South Pearl St. location gives you a great post-meal workout option, via window shopping. The salted caramel cookie is a must."},{"name":"Mister Tuna","cost":3,"address":"\n3033 Brighton Blvd\nDenver, CO 80216\n(303) 831-8862\n","cuisine":"American","review":"Interesting restaurant name and theme tactics have been a thing for as long as we can remember. A weird backstory, off-the-wall design scheme, or cryptic name having nothing to do with the food is fun. We get it. For example, who doesn’t want to eat farm-to-table fusion fare in a converted turn of the century mortuary? But even when checking out a relatively mysterious place for the first time, we still usually know what we’re getting into - except in the case of Mister Tuna.\nWe had heard no real details, and only a few facts:\n\nThe menu and space pays homage to Hawaiian food culture\nThere’s a pickle bar\nThere’s a giant mural depicting the Chef’s mom\nThere are pictures of a pet parrot named Mister Tuna\n\nTurns out not knowing what to expect was a really good thing. Regardless of what they’re trying to do at Mister Tuna (we still aren’t completely sure), we love it. \nThe menu is a nice hodgepodge of pretty much everything: shellfish, pasta, pizza, tacos, sashimi...lamb. All of which are priced high, but done really well. The King Crab is one of the best bites in the city right now. The pastas are fresh and rich, and perfect for the colder fall weather. And the sashimi, one of the only things that has any real relevance to the restaurant name,  is excellent. \nThe space is trendy, has plenty of flash, and is nothing even remotely close to being reminiscent of Hawaii. But don’t sweat the inconsistencies. All you need to know is that the food and atmosphere at Tuna are well worth the trip, especially for upcoming date nights. Nothing really makes sense, but it doesn’t matter, because it’s all good."},{"name":"Wooden Spoon","cost":2,"address":"\n2418 W 32nd Ave\nDenver, CO 80211\n(303) 999-0327\n","cuisine":"Dessert","review":"Denver’s known for many things - craft beer, farm-to-table food sourcing, beautiful people, legal weed. But one important category you don’t hear much about: bakeries. We’re talking full-scale operations with hard-to-pronounce pastries, gooey egg sandwiches, and quaint neighborhood charm. But Wooden Spoon is here to make some noise in that category, from its small, under-the-radar corner shop. \nYou might miss it if you aren’t paying attention, as it’s the size of a broom closet compared to the rest of the block’s storefronts. Actually – you might miss it if it’s a weekday past noon. Because on a Saturday or Sunday morning, you’ll definitely spot it based on the dogs and strollers parked outside alone. What it lacks in comfortable seating and Wi-Fi (your computer won’t fit on their tiny tables anyway), Wooden Spoon easily makes up for with its friendly service, and more importantly, impressive spread of baked goods. Even your gluten free, dairy free, vegetarian friend will find something to love here. That being said, our favorite items aren’t adhering to any of those requirements.\nWooden Spoon serves lunch, but the breakfast situation here is what keeps us coming back. More specifically, the breakfast sandwich keeps us (and everyone else posted up here every weekend) coming back. There aren’t many places in Denver to get a great egg sandwich, but Wooden Spoon has perfected it: steaming hot eggs topped with melty cheddar cheese, bacon, and just enough toasty brioche to hold it all together. It’s rich enough to cure a hangover, but still leaves you feeling okay about your arteries. Maybe it’s just our overactive imagination, but the servers give you this ridiculously big smile when handing off your to-go bag - it makes you feel like you’re in on the neighborhood’s best kept secret.\nWhether you’re here for the first or tenth time, you’ll want to bring some friends so you can try as many things as possible (not too many friends - remember, this place is small). But if you aren’t rolling deep, don’t worry, the only way you can go wrong is if you get here after they sell out (which does happen). \nEven if you’ve never thought about the fact that you needed more bakeries in your life, Wooden Spoon’s breakfast food is good enough that you’ll wonder how you ever got through your Saturdays without it."},{"name":"Ohana Island Kitchen","cost":2,"address":"\n2563 15th St #105\nDenver, CO 80211\n(303) 718-6580\n","cuisine":"Hawaiian","review":"Everybody has their favorite hole-in-the-wall spot: a quaint dive bar, a hamburger stand with questionable health inspector records, an old Mason hall serving strong coffee. We came to love Ohana Island Kitchen when it was a literal hole in the wall: a window-font station in a shared space on a quiet corner just west of The Platte River. Thanks to much-deserved success, it has since evolved into a full-scale operation serving excellent Hawaiian lunch favorites from its own shop (across the street from the hole in the wall). Say aloha to Denver’s best poke stop: Ohana Island Kitchen.The small, cafe-style operation is all about fresh, big flavors - think teriyaki-esque pulled pork, high-quality tuna, sweet rice, and a good amount of spam (don’t be afraid). The food alone sells the place, but the picnic-style seating situation and very friendly staff really ups Ohana’s game, and works well for both hurried and leisurely lunches. \nThe higher prices might give you pause considering it’s lunch, but rest assured, you get what you pay for. Plus, we guarantee eating food this good while relaxing for a few minutes at a picnic table will cure your mid-day work stress. Grab a buddy or two and order the entire menu to share. We’ll see you there."},{"name":"The Preservery","cost":2,"address":"\n 3040 Blake St #101\nDenver, CO 80205\n(303) 298-6821\n","cuisine":"American","review":"The Preservery has all the elements you’d expect from the latest trend of “hot” new restaurants around Denver: \n\n\nSustainably sourced seasonal ingredient focus: Check. \n\n\nMercantile side-shop featuring artisanal pickles: Check.\n\n\nRandom, offbeat (Star Wars themed) design details placed throughout the space: Check.\n\n\nThere’s obviously a heavy focus on aesthetics, which isn’t necessarily a bad thing. But lately in our experience with new places around town, said focus has signalled sluggish service and sub-par food. Thankfully, that’s not the case here. The Preservery is firing on all cylinders.The menu is designed to rotate with the season, and as far as the summer goes, we’re fat and happy. From small plates, to sandwiches, to full-scale sophisticated dinners, everything we’ve tried is excellent. The service too, is great - they have, without a doubt, one of the friendliest staffs around. And they aren’t doing it for the gratuity - taking after the recently trendy NYC model, tip is already included in all the prices.\nThe patio is another big highlight. Positioned just off the bar with enough shade to avoid melting your face off, it’s the kind of porch that’s somehow perfect for dates and bigger group hangs alike. \nAt the southern end of RiNo, The Preservery’s location makes for a nice walk if you’re coming from anywhere around North LoDo - especially before or after a Rockies game. It’s close to Coors Field, yes, but far enough away to avoid drunken stragglers looking to get rowdy. Skip the ballgame traffic here sipping drinks on the patio.\nAll in, The Preservery looks good, it feels good, it tastes good - a nice little trifecta that combines to form what we believe is one of Denver’s best new restaurants, and one you should definitely take advantage of this summer. Get here before the rest of the city finds out."},{"name":"Globe Hall","cost":2,"address":"\n4483 Logan St\nDenver, CO 80216\n(720) 668-8833\n","cuisine":"BBQ","review":"Globe Hall is the kind of place you’d probably avoid if you didn’t know about the smokey food magic happening out back. Dingy walls, barred windows, torn-up barstools, wobbly tables, bad taxidermy... it’s pretty clear there isn’t much effort going into room staging here. We respect that. It’s honestly what you want from a good BBQ place, because it lets you know all the focus is on the right thing - the food. At GH, that’s absolutely the case. They have all the makings of a real Texas smokehouse, including a small-cabin-sized smoker (named Betty) on the patio out back, currently pushing out the best BBQ we’ve ever had in Denver. And the space is actually a 100-year-old Croatian dance hall, which is at least a cool historical fact.\nBrisket, pork, ribs, turkey, sausage, a few sides, and some pie make up the menu, and you can’t go wrong with any of the above - especially the ribs. These are honestly the best ribs in town. Tender, juicy meat that sticks to bone just enough to make the small amount of work you have to put in for each bite totally worth it. Add in the dance hall and live music they offer on the regular and we’re probably going to make GH our official summer headquarters. \nThe only complaint we have is that they occasionally offer weekend yoga classes. We’re willing to give that a pass... as long as they let us grab some of those ribs during our warrior pose."},{"name":"Blue Pan","cost":2,"address":"\n3930 W 32nd Ave\nDenver, CO 80212\n(720) 456-7666\n","cuisine":"Pizza","review":"Detroit. Pretty good at hockey, used to be really good at making cars. Still really good at making chili cheese dogs\/coney’s. But Detroit-style Pizza? Turns out, they’re really good at that too. Detroit-style pizza is highly delicious, and Blue Pan has brought some hip-to-be-square magic-ness to Denver. This tiny, Michigan-proud pizzeria has quickly become part of our regular rotation for quality LoHi eats.Twist our arm for a gripe about the place, and we might (strong might) mention the seating situation inside - “tiny” puts it pretty lightly (seats 10-15 tops) - but that gripe has more to do with us not wanting to wait for a table than the experience BP’s small interior size brings. Despite the elbow rubbing, we like the down home vibe this place gives off. It feels like a small mom & pop stop where neighborhood kids congregate after school for a slice, some soda and a game of jacks out front.\nIf you can swing a table and dine-in, do it. Especially if you’re eating alone. A seat at the bar is one of the best spots in town to catch a game on TV solo. Plus the staff is great at keeping you company. But don’t sleep on the take-out operation - the food doesn’t miss a beat if you’d rather get down at home. The Parma Italia and Brooklyn Bridge options are our favorites, but you won’t be mad at much on the menu. Just know that while they do offer a few thin(er) crust options, we don’t recommend veering away from the Detroit-style mains. Embrace the Motor City stuff and you’ll be happy. Just don’t go requesting any Kid Rock."},{"name":"The Universal","cost":2,"address":"\n2911 W 38th Ave\nDenver, CO 80211\n(303) 955-0815\n","cuisine":"American","review":"The Universal is a place that lives up to its name - it's literally good at everything. The food, the service, the cocktails, the vibe... it's the full package, all wrapped up and tied together with a pretty little Americana diner themed bow.\nThe venue is perfect for both big groups and small, and works even better if you're looking to grab a bite solo - a move we strongly endorse, especially during peak hours. Not only will an unaccompanied breakfast help you avoid the wait on weekends (and you will have to wait), it'll also give you a chance to get serious with an order of corn bread rancheros and custard toast without judgement from those friends who always give you crap for ordering \"more than you can eat.\" As if that's ever possible. Go big here and be proud. The cool waitstaff will likely cheer you on by bringing several rounds of their favorite cocktail to help incentivize your resolve to keep eating.\nIt's always easy to say a place like this has something for everyone, but in this case, it’s actually true. Our only worry is that more people will find out about the U and make the wait longer for us when we head over. Not that we mind waiting for a place this good. \nSee you in line."},{"name":"Bar Dough","cost":3,"address":"\n2227 W 32nd Ave\nDenver, CO 80211\n(720) 668-8506\n","cuisine":"Pizza","review":"Bar Dough, we like you. We’re not afraid to say it. We’re not sure what the future holds, but right now, we are thinking about making you a mixtape. We’ve been on a lot of blind dates, and been disappointed by new restaurants that didn’t live up to the hype. But you are treating us right and we are smitten.\nFalling in love with a new restaurant feels good. But how do you know you’ve found the real thing? Here’s how we know that flutter in our stomachs is more than just indigestion.\n\n\nWe’ve told our mom and our friends about the food.\nBar Dough has something for everyone you know.\n\n\nWe want it more than once a day.\nWe’ve done Happy Hour here, taken a nap, and then come back for dinner here on the same day.\n\n\nWe want to show it off.\nBar Dough is nice enough to take a date, casual enough for a Wednesday night outing with friends, and refined enough for a business dinner.\n\n\nWe have an inside joke with the staff.\nEnjoying the service is important and we’ve been impressed with Bar Dough so far. We assume they feel the same about us.\n\n"},{"name":"Leña","cost":3,"address":"\n24 Broadway\nDenver, Colorado 80218\n720-550-7267\n","cuisine":"Latin","review":"When you graduated from college, you were going to travel around Central and South America like a drunk Magellan in search of food, fun and fiestas. We know because you told us over and over again every time you had more than three margaritas at the Rio. But despite all of that big talk, you spent all of your money on Hot Pockets and bar tabs and the farthest south you ever made it was Cancun junior year.\nDon’t worry, the sting from your missed globetrotting opportunities are about to be dulled by Leña. It’s not Buenos Aires in the spring, but your taste buds probably won’t know you took a 10 minute Uber ride from Downtown to South Broadway to try a hodgepodge of dishes styled after classics from Texas to Tierra de Fuego.\nThe menu has the potential to overwhelm you with goodness, but don’t worry. We've let the servers guide us each visit and we haven’t been disappointed yet. They’ll definitely recommend the Chilaquiles, flank steak and octopus ceviche. And, they’ll be right.\nThe beauty of a place like Leña—besides the awesome food, drinks and atmosphere—is that it can give you a taste of places you’ve never been but without the requisite hepatitis shots. A win-win if you ask us."},{"name":"Recess Beer Garden","cost":2,"address":"\n2715 17th St Ste 103\nDenver, CO 80211\n(720) 638-0020\n","cuisine":"Bar Food","review":"In Denver these days, every new restaurant it seems carries with it a story of sustainability, linked to local sourcing and community give-back. And that’s fine, no one can complain about it. Actually most places that went or are going that route do very well and taste pretty damn good. However, we quite honestly needed a goddamn break from it. How many times do we have to hear about your farm 15 miles away and how happy Milli the chicken is before slaughter?\nThankfully, there’s a beer garden that gives us that break both in name and experience - we’re talking about Recess - a place that doesn’t look to be defined by outward, explicit environmental involvement. Look, we’re sure they have the same concerns we all do, but we’re grateful to see they're more concerned with giving you a relaxing afternoon or evening of fun and great food.\nThink open air bar facing a huge, multi-level patio with picnic seating, lawn games and good scenery. Whether or not it was their intention to look just like an Austin, TX beer garden, that’s the atmosphere you’re going to experience here. We couldn’t really ask for more beyond that, but of course we did in an attempt to check out the food, and again, no complaints. With BBQ plates to share, really good wings and our favorite, green chili smothered tots, you’re gonna want to clear your afternoon and set up camp. It’s safe to say we dig Recess and the refreshing take it’s given the\/our Denver food scene. It likely won’t become your new go-to spot, but you’re always gonna need a break from said spot, and when that happens we highly recommend you head here."},{"name":"Dos Santos","cost":2,"address":"\n1475 E 17th Ave\nDenver, CO 80218\n303 386 3509\n","cuisine":"Mexican","review":"Most trendy taco spots around town carry similar traits - younger crowds, party-ish vibe, pumped up music, big menus with tons of options… basically an atmosphere that feels more club than taco shop. They’re places basically resembling your freshman year in college - you go there to have a good time and find out what you like. But as you start to figure out what that is, you tend to hone in and seek out something much more specific.\nThat’s our analogy for Dos Santos and what they’ve brought to the Denver scene. In fact, we’re officially dubbing them our taco grad school. It’s a smaller space, with smaller crowds and a super focused, smaller menu that looks to do what you like most, better. \nThe scene is very casual and friendly making it just about as perfect a spot as possible for early afternoon sessions when you don’t want to be around a rushed brunch scene. The food comes out fast, the cocktails come stiff and the staff is happy to bring both. And just like that “Urban Legends 300” class you tried to enroll in junior year, it’s gonna fill up fast as more people start hear about it, so get in there before that happens and you’re stuck with the “How to Wait Two Hours For a Meal 101” course."},{"name":"Frasca","cost":4,"address":"\n1738 Pearl St.\nBoulder, CO 80302\n303-442-6966\n","cuisine":"Wine Bar","review":"We have a problem taking the term \"best restaurant in Colorado\" seriously, but those words are often thrown around when it comes to Frasca. To us, it’s too subjective a title - being a \"best restaurant\" anywhere means you’re good at literally everything; not just food, just wine, or just service and courtesy. So while we’re hesitant to hand out a \"best restaurant in Colorado\" nod (partly because we haven’t eaten everywhere in Colorado) we will admit that it only took a few trips to secure our very first Infatuation Denver 9.1 rating.\nFrasca’s focus is as much about wine as it is about food, but not in an mutually exclusive way. It’s based on an idea that balancing the two makes what’s best about both, better. They do this really well. Add in their amazing service and ambiance, and you've got something special. From start to finish on each visit, Frasca makes us feel at home. Members of both the front and back of house staff have always seemed almost humbled to host us and every single other guest in the dining room. No pretension or overdone coddling - just a sort of inviting warmth...only not in a freaky Hansel & Gretel kind of way. That being said, you will be exposed to some story hour time when the wine starts to roll out. Not just taste profile explanations, but actual stories and history lessons about where the wine comes from. Sit back and enjoy. It’s fun, educational, and you’ll likely hear them from a James Beard award winning Master Sommelier.\nThe food at Frasca has a pretty simple focus in terms of preparation and presentation, but we can honestly say it has provided us with some of the best bites we’ve had in awhile. From the prosciutto and breadsticks to the Alaskan cod with trout roe, everything works. \nAs mentioned earlier, we haven’t yet had a bad, or even mediocre experience at Frasca. But if we had to pick our favorite, it’s on Monday nights when they offer their pre-set tasting menu and wine flights. If you’re going for the first time, this is definitely your play. They do the work for you, and it offers a nice sampling of the menu. Think of it as a mini-camp before you take control of the ordering on your next visit, which you’ll definitely be planning. We’re actually planning ours right now."},{"name":"Duo","cost":4,"address":"\n2413 West 32nd Ave.\nDenver, CO 80211\n303-477-4141\n","cuisine":"American","review":"Dear Duo,\nWhatever it was that used to make you dynamic has unfortunately gone missing. That “unfortunately” is very intentional, because we’ve always loved you. Over the past year we knew something was off, but just honestly thought you needed new inspiration. However, after our latest visit, we’re convinced that what you actually need is an intervention. You were once one of Denver’s most consistently raved about restaurants, and deservingly so. Until now.\nSoooo, what’s the deal? Have you’ve gotten bored, developed a drug problem, or just plain burned out? We know your parents\/owners left town awhile back to try some new things in Vermont, but that’s no excuse. Is your food still good? Sure. Is it worth a few hundred bucks? Sorry, but no. Duo, you’ve gotten boring and we need you to pull your shi* together.\nSorry to be harsh, but this is how interventions work. We won’t go as far as to say you need a throat punch, but you do need to wake up to your potential. For one, your name is Duo (2), but the pairings on most of your main dinner plates just don’t jive. You’re disrespecting a perfectly cooked duck breast with slimey quinoa, and a mangled mushroom patty underneath. Your paella is lazy. The hot sauce octopus appetizer? We want this to work, but what you’re doing is not working. We’ll admit that your brunch is still pretty solid, but c'mon, you’re better than brunch. A lot of restaurants around here can do brunch.\nLet’s take a breath, keep things simple, and try to remember what you do best.\nWhy not start with your fried chicken? It’s always amazing. Get it back on your menu, and keep it on the menu - Year. Round. Focus on the small steps, and you’ll get there. We want you back, Duo, but we’re done giving you chances. At least until you give us a reason to give you another chance. Seriously, get your sh*t together. We'll wait patiently."},{"name":"Edgewater Inn","cost":2,"address":"\n5302 W. 25th Ave.\nDenver, CO 80214\n303-237-3524\n","cuisine":"Pizza","review":"Howdy, Paisano.\nEvery lifelong Denverite has four things in common. An unwavering devotion to John Elway, a constant fear of running into their grandma at their favorite weed shop, a continued and unjustified fear of Five Points, and a love for Edgewater Inn pizza. If any of the above don't ring true to you, go back to Iowa, you f*cking tourist.\nFor the newbies and uninitiated, Edgewater Inn serves the best pizza in Denver. I know, I know, throwing around lofty superlatives about pizza might get you shanked in Chicago or forced to watch a Knicks game in New York, but here this is a safe statement. Safe because Denver isn’t really known for pizza. Safe despite the awesome stuff Cart Driver and Hops & Pie are cranking out. And safe because longtime classics are almost always the best.\nDon’t believe us? Go find someone who didn’t move here from California yesterday and ask.\nCouldn’t find anyone? OK, keep reading.\nEdgewater Inn is basically a really clean dive bar that focuses on schooners of Coors and unbelievably good sausage pizza. The service is almost always great, but don’t arrive hangry. Due to a serious take-out operation competing with the in-restaurant dining operation, your order will take 30 minutes or so.\nThat said, it’s worth the wait and will give you time to talk about how crazy the weather is here or how awesome String Cheese was at Red Rocks."},{"name":"Guard and Grace","cost":4,"address":"\n1801 California St.\nDenver, CO 80202\n303-293-8500\n","cuisine":"Seafood","review":"It used to be that a power lunch anywhere outside of the tech center meant having a Kind bar mid-hike. Because let’s be serious, downtown Denver isn't exactly teeming with guys in suits looking to spend lunch with a filet mignon and a glass of Merlot.\nBut every city needs at least one official downtown power lunch spot, at least for the out of town executives who do want meat and fancy silverware. Enter Guard and Grace - a modern steakhouse currently standing court as lunch and dinner HQ for seemingly every business person traveling in and out of metro Denver.\nTurns out focusing that power lunch play around aloof usage of traveling corporate credit cards was genius. Monday through Friday, G&G; packs all 9,000+ square feet of its dining space with formal idea pitch-sters and boondogglers alike. It’s huge, it’s beautiful, and it’s probably making more money than all of its patrons combined.\nLunch is king at G&G;, but the dinner features an expanded menu and the same suited up crowd… only more boozed up. This basically means the people watching gets really interesting at night. Dinner theatre at its best. If G&G; really wants to up its game, they might consider offering a dry cleaning service to help deal with all the grease and wine stained suits that tend to multiply post-sunset.\nLike any respectable steakhouse, both the lunch and dinner menus are huge. You can choose between a full raw bar, a wide variety of starter and sandwich options, a few heavy main courses, and of course, steak. Everything is expensive, but everything is good. Especially if you’re spending someone else’s money. Which is exactly how we recommend you experience Guard and Grace. This isn’t a bill you want to be responsible for."},{"name":"Bistro Barbes","cost":3,"address":"\n5021 E. 28th Ave.\nDenver, CO 80207\n720-398-8085\n","cuisine":"American","review":"Let’s be real for a minute. When’s the last time you went to Park Hill for dinner (or anything)? If you’re feeling shy, we’ll go first—Tables circa 2007. Unless you live in the area, your answer may be never. And guess what, it’s not your fault. There just aren’t many options in these parts. Sure, wine bars and bakeries pop up on certain blocks, but they’re nothing you couldn’t find in your own hood.\nWell, let’s end all the Park Hill abstinence right now because Bistro Barbes is well worth your time and money. It’s an elegant, tiny space - around 20 seats - that’s upscale without being stuffy. So get cozy and crush on the amazing lamb merguez and escargot agnolotti.\nService is friendly and intelligent and the dinner menu is nicely curated. With around three choices for each course, there is no risk of paralysis through analysis. The wine list is similarly pared down, but you won’t lack good choices. Bistro Barbes touts itself as being grounded in French technique with flavors from North Africa, Spain, and the Mediterranean. The first claim is true, but the latter is questionable. Don’t get us wrong, we’re all in, but if the North African and Spanish flavors were turned up even 25 percent, we’d be even higher on this place. Until then, we’ll just have to settle for damn good instead of groundbreaking. You’ve got some real champagne problems these days, Park Hill."},{"name":"My Brother's Bar","cost":1,"address":"\n2376 15th St.\nDenver, CO 80202\n303-455-9991\n","cuisine":"Bar Food","review":"When I was a youngster I actually thought My Brother’s Bar was owned by my uncle, Ed. My mom would say, “let’s go to My Brother’s Bar,” excitement would ensue, inevitably followed by me thinking my uncle must have the night off...again. Kids are so stupid.  \nIt’s easy to see why my younger-self loved this place — in many ways it’s like a fast food joint. The burgers are a little greasy, served on sesame seed buns, and wrapped in paper. The fries and onion rings sit in plastic trays and all condiments come in a plastic caddy they bring to your table, complete with pickles, onions, etc.\nAs an adult man-boy, I find other reasons to appreciate this place. For one, it’s got the character of a Wild West saloon mixed with the vibe of a cool urban hangout.\nProclaimed Denver’s oldest bar, My Brother’s Bar is a mix of old and new. Old: They crank Beethoven and Bach for plenty of hunched-over grandpas at the bar. New: They pack the place with hip Riverfront area residents who are paying a ton of money to live close to REI.\nWhether you’re old, new, or middle school you’ll probably find something to like at My Brother’s Bar. At the very least you’re destined to have a good burger in a place that has about as much history as you can find in Denver.\nAnd if you do find yourself sitting at the bar someday, say hi to Ed. Assuming that dude ever shows up for work."},{"name":"Old Major","cost":3,"address":"\n3316 Tejon St.\nDenver, CO 80211\n720-420-0622\n","cuisine":"American","review":"If you follow food and restaurant news in Denver, there isn’t much you haven’t heard about Old Major. And while the accolades both locally and nationally have fizzled out a bit, it definitely continues to serve as a hotspot for food enthusiasts, Highlands aristocrats and hipsters alike. So, what can we tell you about this restaurant that you haven’t heard? Probably not a lot, but we can offer some advice. If you’re going to do Old Major, do it for an afternoon happy hour on the patio.\nHere are some tips if you decide to go this route: If they’ll let you, try hard to order off the main menu, mainly to see if you can get your hands on some ham & biscuits from the dinner menu. If all else fails, eat a charcuterie plate. You'll also want to get there early and plan to stay for a long time. Sit on the patio, order a stiff drink, and watch the people go by. And whatever you do, don’t come here on a first date. You need to be relaxed so you can enjoy quiet, comfortable people watching and uninhibited consumption of pork parts. Also keep in mind this isn’t a more fiscally responsible way to experience Old Major. Cocktails alone will run close to $10 a pop, this will not be a cheap happy hour experience. But it will be worthwhile.\nWe should also clarify that recommending happy hour over the full-on dinner or brunch experience isn’t our way of saying the headliners at Old Major are bad; you should definitely put it in rotation for both of those meals. But for our money, (and regardless, you’re going to spend a lot of money) a nice long mid-week patio binge is where it’s at."},{"name":"The Kitchen Denver","cost":3,"address":"\n1530 16th St.\nDenver, CO \n303-623-3127\n","cuisine":"American","review":"The Kitchen Denver is a beautiful space. It’s huge, nicely decorated, and located in an amazing spot just off the 16th Street Mall. The views from the gigantic first floor windows make for great people watching, the staff is friendly, and the American bistro menu rotates with the seasons. Flavors are pretty standard, but they’re also pretty darn good. Honestly there’s really nothing to complain about... unless you’ve been to the original Kitchen in Boulder. If that’s the case, this new Kitchen just isn’t going to match up.\nTo elaborate, let’s take a step back. Close your eyes, and think about the first kitchen you had growing up - the family’s main gathering spot, the nerve center for conversations about school, life, love...John Elway. All no doubt part of some pretty great early memories. Eventually though, through your parents upgrading to a nicer house or you moving out to your own place, that original kitchen went away. And with it, the nostalgia and brilliance of its predecessor. That’s how we feel when we visit The Kitchen downtown Denver.\nTo be clear, you aren’t going to have a bad experience at The Kitchen Denver. It’s a safe bet, and there won’t be any surprises. If you set your expectations right, you’ll walk away satisfied. It just isn't going to be all that memorable. For that Kitchen, you’ll need to head down Highway 36."},{"name":"ChoLon","cost":3,"address":"\n1555 Blake St.\nDenver, CO 80202\n303-353-5223\n","cuisine":"Fusion","review":"\"Fusion,\" is a word you're probably familiar with, especially when it refers to Asian cuisine. But does anyone really know what that means? A simple concept, yes. But a concept that is nonetheless usually over-explained without any real clarity. It’s like asking someone to describe Art Deco design - 12 minutes of generalizations and hand wafting will likely ensue, ending in you just wanting to \"art deco\" the describer in the face. Our advice, skip the explanations and learn through experience. In the modern Asian game, let ChoLon be your sensei.\nAdding twists to classic dim sum and larger course dishes, ChoLon is the ideal example of a good Asian \"fusion\" restaurant. Soup dumplings seem traditional on first inspection, and yet there is french onion soup inside of them. The bacon fried rice is a \"carbonara\" with runny egg on top. But ChoLon’s ability to understand where twists & upgrades aren’t needed might be even more impressive. The steamed buns are simple and delicious, with little bells and whistles - just an upgrade to meet the upscale, business-lunch-friendly environment.\nWe love pretty much everything we’ve eaten here (and we’ve eaten everything) and ChoLon is worth trying at least once. It's also worth getting into your permanent rotation, especially if you live or work downtown."},{"name":"The Hornet","cost":2,"address":"\n76 Broadway\nDenver, CO \n303-777-7876\n","cuisine":"American","review":"It’s always easy in the beginning. This is both salient dating insight and true when expanding our restaurant guide into a new town. At The Infatuation, we like good food and we have been selflessly subjecting ourselves to Denver’s very finest eateries like a group of soon to be canonized monks.\n“Please hold for the freaking Pope…”\nFor the most part it’s been a praise fest with the reviews we've been dishing out and that isn’t going to change with our thoughts on The Hornet. This place is an icon, and it deserves some acclaim for serving up great food long before the Baker\/SoBo-area was a happening place.\nUnlike many older relics in changing neighborhoods, The Hornet still feels like the place to be for burgers, brunch, and booze. Happy Hours can be packed and people have lots of compelling reasons to stick around for dinner.\nTo earn its “old reliable” status the Hornet continues to deliver in several key areas. They have a menu chock full of better than average bar food , they are close to some of our favorite SoBo hangs like the Hi Dive and the Mayan Theatre, and the people — both staff and patrons — share a good vibe that make us want to hangout for another cocktail or two.\nThe Hornet isn’t new or shiny but it will still be there for you next year. Which, let’s face it, may or may not be true of the questionable person you are currently seeing. Amen."},{"name":"Work & Class","cost":3,"address":"\n2500 Larimer St.\nDenver, CO 80205\n303-292-0700\n","cuisine":"American","review":"Work & Class’ mantra is “Food for People Who Can Eat.” Considering the fact that our mission here at The Infatuation is to write \"Restaurant Reviews for The People,\" we had a feeling we were going to like this place from the start.\nEver since Work & Class opened last year, the place has been packed with all types of people from Denver who most definitely know their way around a table full of food. The Latin-influenced menu is broken into three main sections: meat, sides, and breads, and is best designed for sharing and sampling among a group. Things like roasted goat and conchinita pibil come in quarter, half, or full pound servings, and will arrive at your table in a silver bowl. The idea is for you to get creative and customize your experience - order some tortillas, some Colorado lamb, maybe some fried sweet plantains (definitely some fried sweet plantains). But if that’s too much responsibility, they'll happily suggest some meat\/side\/bread combinations. Just don't be afraid to let loose a little bit. Embrace the goat.\nWith a small space and no reservations, waits at Work & Class can quickly escalate, but we like to drop in at the end of happy hour and ride on into dinner. Eating at the bar is another smart way to avoid 45 minutes between you and your meal, and the experience is exactly the same. As a matter of fact, we're sure you're going to like this restaurant no matter where you sit. As long as you're a person who can eat."},{"name":"Biker Jim's Gourmet Dogs","cost":2,"address":"\n2148 Larimer St.\nDenver, CO 80205\n720-746-9355\n","cuisine":"Bar Food","review":"What’s not to love about the rags-to-riches story of a 16th Street Mall cart that was so popular they opened not one, but two brick-and-mortar restaurants? Biker Jim’s is the American dream come true, and Denver’s all the better for it. And even despite all of their success, none of it has gone to their head. The people at Biker Jim's are as down to earth as ever, and the cart that started it all is still on the mall serving up lunchtime goodness. So all you pleated khaki and pant suit types, hit the pavement for a dog. Save that sad turkey sandwich for another day.\nBiker Jim’s is all about creativity via exotic meats, including reindeer, wild boar, and rattlesnake-pheasant. With 13 different dog options and 7 special toppings, you’re looking at 91 potential combinations from this menu - and not a one of them will let you down. Not sure that a rabbit and antelope sausage is something you can get down with? You can, and you will. All you have to do is let it into your life. And should you have some religious belief or policy about not eating cute things, don't you worry. Biker Jim's does a really good vegan dog as well.\nAside from a place to eat crazy\/delicious things, Biker Jim's near-LoDo location makes it a great spot to pre-game for a night out or hit up some late night eats. And since Coors Field is just around the corner, we’re petitioning for a satellite location inside the Rock Pile because we’re now embarrassed to have ever eaten a Rockie dog. We have also yet to observe a biker on any of our visits, so no Roadhouse-type fights have popped off that we're aware of. We'll keep our scooter parked out front just in case."},{"name":"Beast + Bottle","cost":3,"address":"\n719 E. 17th Ave.\nDenver, CO 80203\n303-623-3223\n","cuisine":"American","review":"You already know that Denver is filthy with brunch spots. Pretty much every\nreview we've written of a new-ish restaurant in this town refers to eggs\nbenedict at one point or another. But for us, most of them fall short of the\nbrunchtime hype (hi Snooze). Feel the same way? Not to worry. If you’re tired\nof chocolate chip pancakes, campy retro decor, and ironically eating $4 bowls\nof Fruity Pebbles, Beast + Bottle has you covered.\nTaking over the space of dearly departed Olivea, Beast + Bottle opened back\n2012 and made a lot of noise doing so. People were excited about this\nrestaurant out of the gate, and for good reason. This place is serious, in a\nway that has made other chefs and people in the restaurant industry take note.\nThe food is very ingredient-driven, which means the menu changes constantly,\nand the concepts are...advanced. As a matter of fact, the dinner menu can\noften be intimidating and full of things that the lay person might not be\nfamiliar with like \"fregola\" or \"candied pepitas.\" What? You don't always keep\na little fregola in your kitchen? That said, we've always enjoyed coming here\nand trying new things, especially with a glass or two from their excellent\nwine list in hand.\nBack to brunch. This is our favorite time to hit Beast + Bottle. The scene is\na relaxed, and the upscale country house vibe fits perfectly with the farm-to-\ntable focus of the menu. And if you tip to the savory side when it comes to\neating on Saturday afternoon, Beast + Bottle’s menu is right up your alley.\nThey make a chicken and cherry sausage that is officially in the Infatuation\nFood Hall Of Fame, and the arctic char eggs benedict (told you we'd mention\nit) and pizzas are good too. Things can certainly get a little bit pricey, but\nthe portions and quality ensure that you get what you pay for. In a Denver\nrarity, they even take reservations for brunch. Book a table, order a drink,\nand maybe bring your \"obscure ingredient dictionary.\""},{"name":"Sputnik","cost":2,"address":"\n3 S. Broadway\nDenver, CO 80209\n720-570-4503\n","cuisine":"American","review":"Sputnik is hipster as f*ck. Like, polish up your best 1982 rodeo champion belt buckle and rock your fanciest Jeffery Dahmer bifocals because it’s time to eat a vegan cheesesteak, hipster. Further proof, the place is named after the first artificial satellite to orbit the Earth which we assume is either a metaphor for out-of-this-world food or a tribute to how lonely it feels to be a pioneer in almost everything, always.\nIf you don’t have a neck tat, don’t worry. Sputnik will still serve you while you gawk at cool twenty-something’s all wearing the same hat. Fortunately, the food and drinks are good enough that you will be glad you went even if the scene makes you feel a little old.\nWe love a place that takes the time to cater to vegans and vegetarians but also still serve tasty animal-based food, and Sputnik does both well. Almost everything on the menu has a really good no-meat option and they may have the best corndog in Denver — both beef and zucchini versions.\nThe menu has an international theme with stops in the U.S., Mexico, India, Vietnam, Korea and the Middle East. Which makes it the perfect place for those times when you’re craving both tacos and bimimbap.\nSputnik is also located next door to the Hi Dive so you can get full\/drunk before you see that band you’ll be over once they start getting radio play."},{"name":"Comida","cost":2,"address":"\n3350 Brighton Blvd.\nDenver, CO 80216\n303-296-2747\n","cuisine":"Mexican","review":"Everyone loves a small town success story, just like everyone loves food trucks serving street tacos. Put the two together, and welcome to Comida. What started out in Longmont as a bright idea in a bright pink taco truck has now become a fast growing cantina franchise making its way across the Front Range.\nIn setting up shop at The Source, Comida has parked itself in about as perfect a position as possible; regardless of what they do, customer turn-out isn’t going to be a problem. Thankfully, the hard-working values and a quick-but-tasty food focus instilled by its taco truck roots have trickled down the family tree nicely. Comida definitely knows what they do best and they work hard at it. Cheap, but well prepared tacos and quesadillas, a damn fine drink menu, and an energetic openspace atmosphere make even Monday night here feel like Friday. Which is nice - at least until Tuesday morning.\nYes, friends, Comida has successfully pulled off the semi-impossible feat of bringing a good food truck experience indoors, and for that we are grateful. Maybe next they can team up with Uber and bring the also semi-impossible “taco-bar-in-the-car” experience to our rides home. Dare to dream."},{"name":"Rosenberg’s Bagels","cost":2,"address":"\n725 E. 26th Ave.\nDenver, CO 80205\n720-440-9880\n","cuisine":"Deli","review":"The tyranny of Einstein’s is over. Real bagels have arrived and they’re something Denver (and many other cities not called “New York”) has beenlacking for a long time. While everyone else around town is opening globalsmall plate restaurants named something like Noun & Adjective, Rosenberg’s is operating from the heart of Five Points with a modern take on the traditional Jewish deli.\nRosenberg’s bagels are special because they’re boiled in New York water. How? In lieu of redirecting the Hudson River to Colorado with a series of canals, Rosenberg’s set up a filtration system to mimic the mineral content of NYC’s water. The result of all the water manipulation is bagels that are crispy on the outside and chewy on the inside, just as god intended.\nThings are going so well with this authentic bagel operation that Rosenberg’s is currently expanding into an adjacent space to make room for a bigger kitchen and a bakery. Hell, New York itself is even taking notice. That means you should probably get down here and eat one of their excellent smoked fish sandwiches, instead of whatever you’re about to put in your mouth with Asiago cheese and jalapeño on it.\nIt’s been real Einstein’s, but we’re moving on."},{"name":"Lola","cost":4,"address":"\n1575 Boulder St.\nDenver, CO 80211\n720- 570-8686\n","cuisine":"Mexican","review":"When it comes to menu, location, and decor, Lola's looks are pretty irresistible. This Latin seafood hot spot has had people flocking to it since LoHi gentrified a few years back - us included. But despite it being so damn attractive, Lola never quite lives up to our expectations.\nIt's not that we don't like it here. We really do. But it's just that we want to love it, and we never can quite get there. The menu and happy hours always tease something special, and the descriptions for each dish always outline some pretty crave-able sh*t. But for some reason, the food doesn't always match up with what our mouths are wanting. Nothing is under-seasoned, or improperly cooked... but something is barely missing much of the time.\nThe drink options, on the other hand, always deliver. Lola knows their cocktails, and knows how to captivate an audience. Margaritas, mezcals, and a strong tequila menu will ensure that if you hit it for drinks and a few bites, you'll come away happy. In fact, the Cucumber Lemonade recently left one friend saying, “this is going to get me white girl wasted.” Which in Denver, is really just “wasted.” So order seven. And order some octopus tacos.\nThat's how you do Lola right."},{"name":"Mercantile Dining & Provision","cost":3,"address":"\n1701 Wynkoop St.\nDenver, CO 80202\n720-460-3733\n","cuisine":"American","review":"Architecturally, the renovation of Union Station is a complete success. The\nold dingy depot has been transformed into a gleaming and elegant testament to\nDenver’s rise as a city. With its gilded decor and LoDo location, we assume\nthere’ll be 1920s-themed New Year’s Eve parties here from now until forever,\nbut if you’re not waiting for a train or channeling your inner Zelda\nFitzgerald, is there enough to bring you back to this place on an average\nFriday night?\nIf the cocktails at the Cooper Lounge or the Terminal Bar have left you on the\nfence with that answer, one visit to Mercantile Dining & Provision should\nchange your mind. This truly beautiful space is split into a formal dining\nroom and a more casual, European-style market with a bar and high top tables.\nWe’re more fond of the bar with its classic black-and-white tile and legion of\nmeat, cheese, and dessert provisions. It’s as good as a lunch atmosphere in\nLoDo can get. But the modern dining room is also impressive and more intimate,\nand there isn’t a stuffy white tablecloth in sight. Whichever side you choose,\nyou’ll be in good hands with the educated and attentive wait staff, and\nexcellent food across the board. We like Mercantile so much we can even\nforgive the rickety name that helps perpetuate Denver restaurants’ ongoing\nobsession with ampersands.\nGreat cocktails and an impressive, if somewhat intimidating, wine list are on\nhand at Mercantile Dining & Provision, but don’t expect anything too\noutlandish on the dinner menu. Things are pretty buttoned up here, meaning you\nwon’t see any molecular gastronomy or kimchi pupusas, and nothing is\ndeconstructed. Mercantile keeps it relatively simple, but they’re executing at\nan incredibly high level. Union Station is fortunate to have them as a tenant\nand if this is where Denver is going, we’re fully on board."},{"name":"Black Eye Coffee","cost":2,"address":"\n3408 Navajo St.\nDenver, CO 80211\n","cuisine":"American","review":"It’s hard to walk unassumingly into a place like Black Eye Coffee Shop. From an outsider’s perspective, there’s definitely an air of ostentation at play -nautical-ish interior design, ‘6’4\/160lb baristas, a deli refrigerator turned magazine rack.\nBut after you get past all that, you'll find that Black Eye has some of the best lattes and friendliest service in the city. There’s a contagious caring and care-free attitude perpetuating the room, which is no doubt why both freelancers and corporate folks alike frequent the space to get stuff done. There’s also a ton of neighborhood regulars, which helps prove its worth. Black Eye is like a hipster Cheers, only they don’t serve beer, don’t care about the Red Sox, and “Sam” is only relevant because it’s the name of all four dogs leashed up out front. They also have excellent food, which is why you see a full review of the place here on The Infatuation.\nPastries, quiches, and rolls originally occupied most of the menu at Black Eye to match the coffee brews, but lately they've expanded their offerings to include some good sweet and savory breakfast and lunch options. To be clear, their strong suit is still by far focused around beverages, but it’s nice to have a place like this for a quick meal in the Highlands."},{"name":"Izakaya Den","cost":3,"address":"\n1487-A S. Pearl St.\nDenver, CO 80210\n303-777-0691\n","cuisine":"Japanese","review":"Izakaya Den is a gorgeous, two-story space that’s lit like a David Fincher\nfilm and has one of the best patios in town. This place has atmosphere in\nspades, something that's fairly unusual outside of downtown. It’s straight up\nsexy - like silk sheets, candles, and Jodeci on shuffle sexy. If you’ve been\nlooking for a new date spot, you can stop looking.\nAs you might have already heard, the food is top-notch too. There’s something\nat Izakaya Den to please everyone, and dishes like the duck croquettes and\ntan-tan men noodles are particularly impressive. Also impressive is the fact\nthat Izakaya Den has carved out its own identity while living in the shadow of\nits beloved older brother Sushi Den. Luckily, the service matches the decor\nand the food. During our visits, two separate managers came by to check on us\nand make sure everything was good. That's the kind of attention to customer\nsatisfaction that's all too rare these days.\nRare like Jodeci."},{"name":"Federal Bar & Grill","cost":2,"address":"\n2544 Federal Blvd.\nDenver, CO 80211\n303-728-9479\n","cuisine":"American","review":"Walk into Federal Bar and Grill, and you might feel as though John\nTaffer and his band of Bar Rescue\njuggernauts were just there. There’s a strategically placed popcorn machine\ndesigned to increase your thirst quotient by 33.4%. There is ping pong and\nTrivial Pursuit on hand to ensure the average customer buys 1.4 more rounds of\nbeers while in the heat of competition. Even the staff plays the blue-collar,\ndown-on-their-luck, but clearly possessing a heart-of-gold, role.\nThree straight weekends watching non-stop Spike TV neither confirmed nor\ndenied this origin story but we don’t care - Federal Bar & Grill is damn good.\nTake a quick look at the menu and you will see this isn’t a bunch of dumb-\ndowned munchies administrated by a hack cook (with a heart of gold) who can’t\nwork the fryolater. Thought was put into the food, and the execution is\ncommendable. In fact, we’re comfortable saying Federal Bar and Grill fits into\nthe “better than most bar food but not quite as good as Fruition” category we\njust created.\nIts location is also key. The Mile High\/Jefferson Park-area is starting to see\nHighlands-like rent, but places to walk to and have a good meal are still few\nand far between. That’s changing with additions like Sarto’s and Federal Bar &\nGrill. So you better buy in this area now, and by that I mean someone please\nmake me an offer on the house I bought 7 years ago nearby. I need an exit."},{"name":"Devil's Food","cost":2,"address":"\n1020 South Gaylord St.\nDenver, CO \n303-733-7448\n","cuisine":"American","review":"Devil’s Food is one of our favorite morning food spots in Denver, but if you don’t spend much time near Wash Park, we're betting you’ve never heard of it. Let's fix that.\nBrunch is the star at this Southern comfort restaurant, with excellent items like a tomatillo burrito that we can't eat enough of and chicken and waffles that will do you up just right. Dinner is good too, mostly because many of the best items from earlier in the day are still on the menu. And any place that serves breakfast for dinner is good in our book.\nThe crowd at Devil's Food is typical Wash Park - lots of sun damaged décolletages and Lululemon pants with dogs and strollers safely stowed outside. By the way, who are you double-wide stroller people? This sidewalk tyranny cannot stand.\nThankfully, you can avoid all this unnecessary weekend brunch silliness by simply arriving before 10am. Even if you make it early, we wouldn’t recommend going with a group larger than two during the weekend unless you have some time on your hands. There are only a handful of four tops and the dining room is pretty small.\nShould you find the wait to be unbearable, you can always just grab a coffee and some tasty pastries from the bakery table and take them to go. Or you can pass the time outside petting dogs. With this crowd, you can bet they’ve all been through obedience classes."},{"name":"Hops & Pie","cost":3,"address":"\n3920 Tennyson St.\nDenver, CO 80212\n303-477-7000\n","cuisine":"Highlands","review":"What’s the first thing you think of when you hear “artisan pizzeria” and “craft beer tap room” together in the same sentence? If you said, “the hipsters”, we’d probably agree with you. In this case, however, those words perfectly describe Hops and Pie - one of the better pizza and beer hangs we’ve seen around Denver. And even though you’re still likely to bump into a few of Denver's finest Brooklynites while you're here, you probably won't mind. Because you'll be face deep in an excellent pizza.\nHighlights from the artisan pizzeria part of Hops focuses around a lot of fresh topping options and a made-from-scratch dough. You'll find a nice variety of snacks, salads, and sandwiches on the menu too, but the pie is where it's at. Keep in mind that all of the toppings will sound good, but don’t f*ck it up trying to kitchen sink your order. Less is more. And if the build-your-own route is too intimidating, a rotating slice-of-the-day, and artisan-pie-of-the-month are there to bail you out. The Tap Room offers 20+ well curated taps and a knowledgeable staff (apparently you can double major in mustache design and craft beer somewhere around here). They’ve managed to bring a nice balance that caters to both beer connoisseurs and common boozers alike. And while craft brew pubs aren’t hard to find in Denver, we’re guessing this place has something worthwhile that you haven’t yet seen or sampled.\nWith ever-changing daily and recurring weekly specials you’ll want to make Hops & Pie part of your regular rotation if you live nearby. Tables can be hard to come by on evenings and weekends, but waiting is actually a worthwhile part of the experience. Take the opportunity to sample some beers, and snoop what's flowing out of the kitchen to get a feel for what’s looking good that night. If we have one complaint, it’d be about the price. A few large pizza’s with toppings can get pretty expensive - but you definitely get what you pay for."},{"name":"Green Russell","cost":3,"address":"\n1422 Larimer St.\nDenver, CO 80202\n303-893-6505\n","cuisine":"Bar Food","review":"Denver is a beer town. That much we know. Just walk into any bar, restaurant, gas station, or day care center, and you'll find about 21 local brews on tap, and probably some more being made on premises. That's been the case since the big \"microbrewery\" boom in the '90s, and it remains true today - even as much of the rest of the country is just now figuring out that Stella Artois is Europe's Old Milwaukee.\nBut as Colorado was soaking up the suds, we were falling behind the fast moving cocktail culture trend, despite companies like Stranahan's making excellent whisky right in our back yard. \"Mixology\" as they call it (we refuse to) became a big business over the last seven years or so, and up until recently, there weren't all that many places in Denver where you could get a quality Old Fashioned, let alone a Sazerac. Green Russell was one of those few places.\nOpened in 2010 by Frank Bonanno and partners, Green Russell is Denver's best and most well-known spot for a quality drink. It's a Prohibition-style speakeasy in the mold of many that came before it, and by that I mean other places exactly like Green Russell that set up shop in cities like New York and Los Angeles around 2005 or so. The formula for all of these \"neo-speakeasies\" is pretty much the same - guests walk down some stairs and arrive at some sort of \"front\" (here it's a pie shop), then speak to a reservationist, eventually being seated after walking through some weird door or something. Cocktails featuring absinthe and molasses ensue.\nWe're always fans of a stiff drink here at The Infatuation, and we like Green Russell a lot. It's always a good place to hang with some friends, even though sometimes it feels a bit steamy down there under the street. But we're not here to just talk about drinks. We're here to talk about food, and Green Russell actually does that pretty well too. There's a solid menu of bar snacks that do a better job of keeping you satiated while you drink high-proof alcohol than they need to, and you can even have a slice of pie if you so choose. We're fans of their loaded potato chips, and pulled pork nachos, and if you want to get down on a full BBQ experience, they've even got an adjacent smokehouse where you can eat ribs with your expensive Manhattan. That one will get its own review at some point. We can only handle one trend at a time per review."},{"name":"Cart-Driver","cost":2,"address":"\n2500 Larimer St.\nDenver, CO 80205\n303-292-3553\n","cuisine":"Pizza","review":"When a menu lists offerings as diffuse as pizza, oysters, and soft serve it’s usually a sign you’re in for a bad meal. It’s also reminiscent of all of the horrible places you ate at in high school that served seafood, turkey melts, and burritos. But needn’t you worry, former-Village-Inn-heads. Cart-Driver’s seemingly random mix of food will make you forget all those late nights spent eating subpar grilled cheese and writing your Riot Grrrl zines.\nNot only is Cart-Driver good, it's surprisingly some of the better pizza you can find in this town. Why is it surprising? Well, because the restaurant is basically an elegant shoebox (okay, it’s a shipping container) with a wood burning oven inside. It's also more of a pizza counter than a restaurant, where you order at the register and hope you can land a table. We've been lucky on most of our visits, and at the very least, the people at Cart-Driver are so nice that you won't mind waiting. Just know that this Ikea model apartment is not for big groups, and that if things get too jammed up, it’s best to take your pie to go.\nDespite - or maybe because of - its diminutive size, Cart-Driver is a great neighborhood hang where you could spend hours drinking too much beer and eating too much pizza. And we’ll never discourage that behavior, especially when the food is this good. This is “fast casual” at its best, or as they call it, \"slow food, fast.\" It's the perfect place to start or end your night, as Cart-Driver is open until midnight daily, with rotating options for pizza, oysters and boozy gelato. Denver keeps getting better all the time."},{"name":"Root Down","cost":3,"address":"\n1600 W. 33rd Ave.\nDenver, CO 80211\n303-993-4200\n","cuisine":"American","review":"Root Down has been serving up seasonal fare since 2008, back when they were really one of the first restaurants to make some noise up here in the Highlands. But things have changed. Long an island onto itself, Root Down has a ton of competition these days. Trendier neighbors like Old Major, Uncle, and Williams & Graham get more shine, but Root Down just keeps puttin’ in work. And we here at The Infatuation are big fans.\nAll the things we love about Root Down have remained the same since they opened. The decor is elegant (for a former gas station), but relaxed. Service is excellent without being stuffy. And the patio is still one of the best in town, featuring great views of downtown. Most importantly, though, the food is always really good. Root Down is now a Denver staple, and regardless of the newer, flashier restaurants that will surely continue to surround it, this restaurant will be a staple for years to come.\nThere are plenty of vegan, vegetarian, and\/or gluten-free options on the menu at Root Down, and while that's much of what they made their name on, you don’t have to be someone who pretends to like the taste of chickpea flour to enjoy a meal here. As a matter of fact, one of the better things here is a $31 short rib, and the cocktails are always strong and creative. Nothing like a stiff drink to wash down a whole sh*tload of brussels sprouts and legumes. And while dinner is the focus, brunch is also an extremely popular and reliable move. The mole breakfast burrito alone is worth a visit. You can even substitute in \"Soyrizo\" if you like, and we might even try that once we know what it is. Then again, no we won't."},{"name":"The Populist","cost":3,"address":"\n3163 Larimer St.\nDenver, CO 80205\n720-432-3163\n","cuisine":"American","review":"Small plates. Community tables. Limited reservations. Closed two days a week.\nIt felt like the Populist made a checklist of things to keep us away. And for\nquite a while, we stayed away. Denver is awash in the played out small plate\nconcept and community tables just make me wanna yell “No New Friends”. If your\nidea of a nice night out is sharing a bench with people talking about their\nkickball league or how wasted they got last night, more power to you. But this\nisn’t New York - we’ve got plenty of room out here and I don’t need to be up\non some dude’s hip while I eat dinner. On top of all that, the place is only\nopen 25 hours a week.\nEnough complaining though. We come to praise the Populist, not to bury it.\nDespite all advance annoyances, this place is absolutely incredible. The\nconstantly changing menu is diverse and full of strong flavors. And while\nthere are a lot of different cuisines and styles going on, nothing feels out\nof the kitchen’s wheelhouse. You can taste when a restaurant is beyond its\ndepth and there’s no risk of that here.\nThe open-air patio at The Populist feels like a Goop post brought to life.\nWith ivy and strung lights it’s a real oasis and, given its distance from\ndowntown, is largely devoid of traffic noise. You may have to endure copious\nmentions of the words “craft” and “artisanal” from your neighbors, but the\nscene is pretty great otherwise. We have to give special mention to the\nservice, primarily for the tandoori chicken recommendation. That dish is\nstraight amazing and one of our new favorites in town."},{"name":"Table 6","cost":3,"address":"\n609 Corona St.\nDenver, CO 80218\n303-831-8800\n","cuisine":"American","review":"After a while, you’re probably going to get sick of us waxing nostalgic about “old Denver.” But we’re probably going to continue doing it anyway. Get ready for more Celebrity Sports Center and Karl Mecklenburg references. Unfamiliar with those terms? That’s exactly why were’ going to keep it up. You need to get learned on some stuff, person who moved here in the late 2000s. This is a city in which many of the good things are new (including, maybe, you), but the best of it is not.\nTable 6 is most definitely not a new restaurant. This place has operated at 6th Avenue and Corona since 2004, and in Denver restaurant terms, that pretty much makes it The Parthenon. Because of its relative \"senior\" status, Table 6 doesn’t get talked about much anymore. People are too busy talking about ramen, or whatever is happening in RiNo (probably ramen). We’d like to change that, because this a place worth having in your dinner and brunch rotation.\nBased on the fact that it’s old and in Colorado, you shouldn’t be surprised to learn that Table 6 serves “American” food, meaning pork and fish and obviously brussels sprouts. America is nothing if not predictable. The menu here is also highly seasonsal, and that means that things change almost daily. But what we like about Table 6 is how unpredictable it often is. For every duck confit and piece of lamb you'll see here, you'll also often find things like chicken wings and patty melt sliders, all executed on a level appropriate for the environment. What I guess I am trying to say in so many words is that this place serves fancy tater tots and that's awesome.\nThere are other awesome things about Table 6, like the warm room and open kitchen, and the fact that the service is both knowledge and friendly. They also have a great wine list, including a daily special where they showcase a weird\/rare varietal at a good price per glass. It all adds up to a place we like very much, especially due to the fact that they don't take themselves too seriously. There aren't many restaurants that can say that around here, and there aren't many that have been doing it as long as Table 6 has. Chalk one up for the old guys.\nAll photos by Tobin Voggesser for The Infatuation\nDue to the fact that the menu changes so often at Table 6, consider this Food Rundown a visual representation of what might be available."}]